quiz-master-api/app/controllers/questions_controller.rb

SELECT `correct_rates`.* FROM `correct_rates` WHERE `correct_rates`.`question_id` IN (1, 3, 4)
SELECT `questions`.* FROM `questions` ORDER BY correct_rate ASC
---
  def index
    @order = params[:order]
    if @order == "difficult"
      @questions = Question.includes(:correct_rate).order("correct_rates.correct_rate ASC").all

INSERT INTO `questions` (`content`, `answer`, `created_at`, `updated_at`) VALUES ('test', 'answer test', '2017-07-31 18:13:57', '2017-07-31 18:13:57')
---
  def create
    @question = Question.create!(question_params)

UPDATE `questions` SET `content` = 'test<span style=\\\"color: red;\\\">tesaa<\\/span>', `updated_at` = '2017-08-06 11:13:58' WHERE `questions`.`id` = 4
---
  def update
    @question.update(question_params)

DELETE FROM `questions` WHERE `questions`.`id` = 2
---
  def destroy
    @question.destroy

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
SELECT  `correct_rates`.* FROM `correct_rates` WHERE `correct_rates`.`question_id` = 4 LIMIT 1
UPDATE `correct_rates` SET `correct_count` = 0, `incorrect_count` = 1, `correct_rate` = 0, `updated_at` = '2017-08-07 10:58:19' WHERE `correct_rates`.`id` = 1
---
  def answer
    @userAnswer = params[:answer]
    @id = params[:question_id]
    @questionAnswer = Question.find(@id).answer

    @result = check_answer(@userAnswer, @questionAnswer)

    @correctRate = CorrectRate.find_or_initialize_by(question_id: @id)
    @correctRate.update_by_answer_result(@result)

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` IN (NULL, NULL)
---
  def set_question
    @question = Question.find(params[:id])